Repository: godiard/help-activity
Catalog: translated_po/*/chat.po
Languages: es

source: Chat
es: Charlar

source: About
es: Acerca de

source: The Chat Activity is used to exchange messages with your friends or classmates. You can chat about a topic you are studying or you can share something private that happened in your life. You need at least two active XOs to chat - your own and the one that your friend uses.
es: La actividad Charlar se utiliza para intercambiar mensajes con tus amigos o compañeros de clase. Puedes charlar sobre un tema que se está estudiando o puedes compartir algo privado que pasó en tu vida. Necesitas por lo menos dos XO activos para charlar - el tuyo y el que tu amigo utiliza.

source: Using Chat
es: Usando Charlar

source: Starting Chat
es: Iniciando Charlar

source: Chat creates text conversation with others XO users. Chat is a shared activity, with one or many other "Friends" in your "Neighborhood", or those connected to your olpc mesh network.
es: Charlar crea una conversación de texto con otros usuarios de XO. Charlar es una actividad compartida, con uno o muchos otros "amigos" en tu "Vecindario", o aquellos conectados a la red de malla olpc.

source: The Chat Activity icon is a speech bubble. To add the Chat Activity to your home view, click the star on the left side of the icon. Now click on the Chat icon to start.
es: El icono de la actividad Charlar es una burbuja de diálogo. Para añadir la actividad Charlar a tu vista de inicio, haz clic en la estrella en el lado izquierdo del icono. Ahora haz clic en el icono de Charlar para comenzar.

source: Sharing Chat
es: Compartiendo Charlar

source: You can either share Chat publicly or keep it private and invite specific people to join.
es: Puedes compartir Charlar en público o mantenerlo en privado e invitar a personas específicas a unirse.

source: In the Chat toolbar, there is a circle icon with a dot. Click on this icon and select the neighborhood or public sharing.
es: En la barra de herramientas de Charlar, hay un icono de círculo con un punto. Haz clic en este icono y selecciona el vecindario o el uso compartido público.

source: When you have selected the Neighborhood View, find a friend to invite and hold the pointer on their icon until the "Invite to" popup appears. Now a Chat icon appears in the menu and the friend gets an invitation to Chat in their frame. Your Chat icon also appears in their Neighborhood view.
es: Cuando hayas seleccionado la vista de vecindario, encuentra un amigo para invitar y manten el puntero sobre su icono hasta que parezca la opción "Invitar a " Ahora, un icono de chat aparece en el menú y tu amigo recibe una invitación para hablar en su marco. Su icono de chat también aparece en su vista de vecindario.

source: You can invite as many other XOs to your Chat as you like, creating a private group discussion. Anyone else who joins can invite others.
es: Puedes invitar a tantas otras XO a Charlar como quieras, creando un grupo de discusión privada. Cualquier persona que se une puede invitar a otros.

source: Join a Chat
es: Únirse a una charla

source: You can join a Sugar Chat that has already been started.
es: Puedes unirte a una charla de Sugar que ya se ha iniciado.

source: Two or more XO computers from One Laptop Per Child can speak to each other directly without an Internet connection. This is a direct connection. You can also chat with people on the Internet who use Sugar. This section describes joining a chat between two or more XO computers from One Laptop Per Child.
es: Dos o más computadoras XO de One Laptop Per Child pueden hablar entre sí directamente sin una conexión a Internet. Esta es una conexión directa. También puedes charlar con personas en Internet que utilizan Sugar. Esta sección describe unirse a una charla entre dos o más computadoras XO de One Laptop Per Child.

source: First, look at the Neighborhood View to see if there is an existing Chat you want to join.
es: En primer lugar, mirar la vista de Vecindario para ver si hay un chat existente al que desees unirte.

source: **CHAT SAFELY**: Only chat with someone you know. If a someone invites you to chat, don't chat with them unless you know them.
es: ** CHARLA CON SEGURIDAD **: charla sólo con alguien que conozcas. Si una persona te invita a charlar, no lo hagas a menos que lo conozcas.

source: If you see a XO icon with a little speech bubble icon next to it, that person is in a shared Chat. Several people may be around the Chat icon, showing a group Chat.
es: Si ves un icono de XO con un pequeño icono de burbuja de diálogo junto a él, esa persona está en una charla compartida. Varias personas pueden estar alrededor del icono de Charlar, mostrando un grupo de charla.

source: Click the little speech icon, and select the Join option.
es: Haz clic en el pequeño icono de Charlar, y seleccione la opción Conectar.

source: Then the Chat Activity starts, connected to the shared Chat. You see the other people in the Chat, on the Frame.
es: Entonces la actividad Charlar se inicia, conectadose a la charla compartida. Puedes ver a las otras personas compartiendo Charlar, en el Marco.

source: Chatting
es: Charlando

source: Once you are in the Chat Activity, you can begin typing to send a message and chat with the other person. After you type a message you can press the enter key to send it.
es: Una vez que estés en la actividad Charlar, puedes comenzar a escribir para enviar un mensaje y charlar con la otra persona. Después de escribir un mensaje, puedes pulsar la tecla Entrar para enviarlo.

source: To enter messages type them in the box at the bottom of the Chat Activity. Always press enter at the end of the message. Once you press enter your message appears on your friend's computer.
es: Para introducir mensajes que escriba en el cuadro en la parte inferior del chat Actividad. Siempre presione intro al final del mensaje. Una vez que pulse entrar aparece el mensaje en la computadora de tu amigo.

source: Accept an invitation to chat
es: Aceptar una invitación para conversar

source: You may be invited to chat. An invitation appears as a little speech icon in the upper-left of the screen in every view. (The invitation also appears on the Frame.) The colors of the icon match the colors of the friend who sent the invitation.
es: Puedes ser invitado a charlar. Una invitación aparece como un pequeño ícono Charlar en la parte superior izquierda de la pantalla en todas las vistas. (La invitación también aparece en el Marco.) Los colores del ícono coinciden con los colores del amigo o amiga que ha enviado la invitación.

source: You accept the invitation by hovering over the icon and selecting Join. You decline the invitation by selecting Decline.
es: Tu aceptas la invitación poniendo el cursor encima del ícono y seleccionando Únete. Tu rechazas la invitación seleccionando Rechazar.

source: Things to Do with Chat
es: Qué hacer con Charlar

source: Chat is a great for sending messages back and forth with a friend, socializing, and working together on projects.
es: Charlar es genial para enviar mensajes de ida y vuelta con un amigo, socializar y trabajar juntos en proyectos.

source: Remember that being polite on a computer is just as important as being polite when you're speaking with someone.
es: Recuerda que ser educado en un equipo es tan importante como ser cortés cuando estás hablando con alguien.

source: Be polite. Try not to interrupt.
es: Se cortés. Trata de no interrumpir.

source: Read through what people are saying before you say something.
es: Leer a través de lo que dice la gente antes de decir algo.

source: Don't type in ALL CAPITAL LETTERS. This style is considered rude as it is like shouting at someone.
es: No escribas en MAYÚSCULAS. Este estilo se considera de mala educación ya que es como gritarle a alguien.

source: If you do not speak the same language as another person it may be difficult to communicate with Chat. Be patient. If you have an Internet connection, you can try going to www.google.com/translate and type in a phrase that you want to say in another language so you can be friendly online.
es: Si no hablas el mismo idioma que la otra persona puede ser difícil comunicarse con Charlar. Se paciente. Si tienes una conexión a Internet, puedes intentar ir a www.google.com/translate y escribir una frase que quieras decir en otro idioma para que puedas ser amigable en línea.

source: **Fun**
es: ** Diversión **

source: It can be fun to make words shorter when typing in a Chat Activity because it is faster, like texting (sending messages) on a mobile phone. For example instead of typing in "how are you?", you can type in "how r u?"
es: Puede ser divertido hacer palabras más cortas al escribir en la actividad Charlar porque es más rápido, al igual que en el envío de mensajes de texto en un teléfono móvil. Por ejemplo en lugar de escribir "nos vemos alli", Puedes escribir "nva"

source: The following are some ways you might like to try using Chat:
es: Las siguientes son algunas maneras en que puedes intentar en Charlar:

source: Arrange a time to meet friends to play.
es: Organizar un tiempo para reunirse con amigos para jugar.

source: Organize a community gathering.
es: Organizar una reunión de la comunidad.

source: Bring friends together to talk about doing a group project.
es: Reunir amigos para hablar de hacer un proyecto de grupo.

source: Brainstorm ideas (either "fast and furious" or by taking turns).
es: Una lluvia de ideas (ya sea "rápido y furioso" o por turnos).

source: Ask your teacher questions about your homework.
es: Hacer preguntas a tus maestros acerca de su tarea.

source: Use Chat and write a story with friends online using the Write Activity.
es: Utilizar Charlar y escribir una historia con amigos en línea utilizando la actividad de escritura.

source: Use Chat to practice writing in a foreign language (see if you can find a native speaker to chat with).
es: Utilizar Charlar para practicar la escritura en una lengua extranjera (ve si puedes encontrar un hablante nativo para charlar con el).

source: Organize other Sugar or XO users to meet and learn from each other.
es: Organizar con otros usuarios de Sugar o XO para conocer y aprender unos de otros.

source: Use Chat to communicate with a grandparent or other family member.
es: Utilizar Charlar para comunicarse con un abuelo u otro miembro de la familia.

source: Interview an expert using the Chat Activity as if they were in the classroom, especially an expert who wouldn’t otherwise be able to visit.
es: Entrevistar a un experto usando la actividad Charlar como si estuviera en el salon de clase, especialmente si no es posible visitarlo de otra forma.

source: Take group discussion notes.
es: Tomar notas de discusión en grupo.

source: Play a word-association game such as typing the first word that comes to mind when your friend types red.
es: Juega un juego de asociación de palabras tales como escribir la primera palabra que viene a la mente cuando tus amigo escriben rojo.

source: Play a role-playing game (for example, have a friend pretend to be a character from a book you are reading, and chat with the role-playing friend).
es: Juega un juego de rol (por ejemplo, un amigo debe pretender ser un personaje de un libro que está leyendo, y charlar con el amigo en ese rol).

source: Use emoticons in Chat
es: Utilizar emoticonos en el chat

source: There are ways to tell friends how you feel just by using letters - they can let someone know if you are happy, sad, or having fun. When you make letters look like a face, they are called emoticons.
es: Hay maneras de decir a tus amigos cómo te sientes simplemente utilizando letras - para que alguien sepa si tu estas feliz, triste, o divertido. Cuando las letras parecen a una cara, se llaman emoticonos.

source: Some are written so that you read them sideways.
es: Algunos están escritos para que los leas de lado.

source: This is a happy face:
es: Esta es una cara feliz:

source: This is a sad face:
es: Esta es una cara triste:

source: This is a wink:
es: Este es un guiño:

source: See if you can find the keys on the keyboard to make the faces
es: Vea si puedes encontrar las llaves en el teclado para hacer las caras

source: The two dots are the colon key : and the semicolon key ;
es: Los dos puntos son la tecla :, y el punto y coma la tecla ;

source: The mouth are the parentheses keys ()
es: La boca son las teclas paréntesis ()

source: You can also make faces that go across:
es: También puede hacer caras horizontales:

source: Happy
es: Feliz

source: Sad
es: Triste

source: Winking (^_~)
es: Guiño (^ _ ~)

source: What other emoticons can you create with text in the Chat Activity?
es: ¿Qué otros emoticonos se puede crear con el texto en la actividad Charlar?

source: Can you draw pictures using only the text symbols on your keyboard? This combination of a symbol and a number looks like a sideways heart <3. "I <3 my XO" means, "I love my XO."
es: ¿Puedes dibujar utilizando únicamente los símbolos de texto en el teclado? Esta combinación de símbolo y número parece un corazón de lado <3. "Yo <3 mi XO" significa, "Yo amo a mi XO. "

source: Make Friends
es: Hacer amigos

source: When you are in the Neighborhood View, if you move the pointer over someone, you can see their name, and click Make Friends. When you Make Friends, your new friend appears in your Group View list.
es: Cuando estás en la Vista de Vecindario, si mueves el puntero sobre alguien, se puede ver su nombre, y hacer clic en "Agregar amigo". Cuando haces amigos, tu nuevo amigo aparece en su Vista de Grupo.

source: The Group View list helps you keep a list of your friends online who you like chatting with.
es: La Vista de Grupo te ayuda a mantener una lista de tus amigos en línea con los que te gusta charlar.

source: Read a past log of conversations
es: Leer un registro pasado de conversaciones

source: If you open the Journal Activity to open the Chat in the detail view, you can choose to open the Chat Activity with the Write Activity instead of the Chat Activity window.
es: Si abre el diario de actividades para abrir Cahrlar en la vista detallada, se puede optar por abrir la actividad Charlar con la actividad de escritura en lugar de con la actividad Charlar.

source: Notes for parents and teachers
es: Notas para los padres y maestros

source: Chat presents a great opportunity engage children in reading and writing. The natural inclination for children to socialize and express themselves can be channeled in some of the exercises outlined above. (Some children who are by their nature shy and reserved, are more confident speaking up in a chat room.) Chat can be motivating and is an authentic use of language skills, however, preparation and supervision are recommended.
es: Charlar presenta una gran oportunidad de involucrar a los niños en la lectura y la escritura. La inclinación natural de los niños para socializar y expresarse puede ser canalizada en algunos de los ejercicios descritos anteriormente. (Algunos niños que son, por su naturaleza tímida y reservada, tienen más confianza hablando en una sala de chat. ) Charlar puede ser motivador y es un uso auténtico de las competencias lingüísticas, sin embargo, se recomienda la preparación y supervisión.

source: Prepare your children and students:
es: Prepara a tus hijos y estudiantes:

source: Remind them never to chat with someone they don't know.
es: Recuérdales nunca charlar con alguien que no conocen.

source: Remind them to be courteous and never to use language they wouldn't be comfortable with in their oral communication (for example, it's OK to disagree, but not to be disagreeable).
es: Recuérdales ser corteses y nunca usar lenguaje que no estarían cómodos usando en su comunicación oral (por ejemplo, que está bien no estar de acuerdo, pero no ser desagradable).

source: Prepare your chat session:
es: Prepara tu sesión de chat:

source: Some teachers prepare questions in advance. They can paste these questions into the Chat session from the Clipboard or Write Activity—this helps them stay on task and keeps the pace of the session lively.
es: Algunos maestros preparan preguntas por adelantado. Pueden pegar esas preguntas en la sesion de Charlar desde el portapapeles o la actividad Escribir. Esto los ayuda a permanecer en la trea y mantener el ritmo de la sesión animado

source: Limit the number of students participating in the Chat session; more that 10–12 participants makes a session chaotic.
es: Limita el número de estudiantes participando en una sesión de Charlar; más de 10 o 12 participantes la hacen caótica.

source: Ask your students to prepare by posing questions in advance.
es: Pide a tus estudiantes que se preparen haciendo preguntas por adelantado.

source: As in any classroom discussion, keep the conversation focused on just one or two topics.
es: Al igual que en cualquier discusión en el aula, que la conversación se centre en sólo uno o dos temas.

source: IT IS SOMETIME USEFUL TO USE ALL-CAPS TO GET EVERYONE'S ATTENTION.
es: A veces es útil usar MAYÚSCULAS para lograr la atención de todos.

source: Advanced features
es: Las funciones avanzadas

source: Computers not running Sugar can initiate chat connections to a Sugar user by running a Jabber (XMPP) client, either with both computers registered on the same Jabber server or by running a link local XMPP account such as Empathy with salut or Pidgin with Bonjour.
es: Las computadoras no correr Sugar puede iniciar conexiones de chat a un usuario Sugar mediante la ejecución de un cliente Jabber (XMPP), o bien con ambos equipos registrados en el mismo servidor Jabber o ejecutando una cuenta XMPP con enlace local como Empathy con salut o Pidgin con Bonjour.

source: Here's an example of a buddy list on another non-Sugar computer.
es: He aquí un ejemplo de una lista de amigos en otro equipo que no es Sugar.

source: When you initiating the chat on a non-Sugar computer using a Jabber client, an invitation appears on the Sugar computer and the Sugar user can chat with you as usual except that the colors of the non-Sugar participant's response lines are gray as shown below.
es: Al iniciar el chat en un ordenador que no sea Sugar utilizando un cliente Jabber, una invitación aparece en el equipo de Sugar y el usuario Sugar puede charlar contigo, como de costumbre, excepto que los colores de las líneas de respuesta de los participantes no-sugar son de color gris, como se muestra a continuación.

source: Here's what the non-Sugar computer sees on their Jabber client.
es: Esto es lo que el equipo no Sugar ve en su cliente Jabber.

source: And here's the response as seen on the Sugar computer.
es: Y aquí está la respuesta como se ve en el equipo de Sugar.

source: CHAT SAFELY: Remember, only chat with someone you know. If someone invites you to chat, don't chat with them unless you know them. It's perfectly okay to refuse a chat request.
es: CHARLAR CON SEGURIDAD: Recuerda, sólo chatear con alguien que conoces. Si alguien te invita a charlar, no charlar con ellos a menos que los conozcas. Está perfectamente bien rechazar una solicitud de charla.

source: Note to parents and teachers
es: Nota para los padres y maestros

source: You can use this feature to chat with Sugar-enabled computers from non-Sugar-enabled computers; hence you can chat with your child or class from a conventional desktop or laptop computer.
es: Puedes utilizar esta función para charlar con los equipos compatibles Sugar desde equipos que no tienen Sugar instalado; por lo tanto, se puede charlar con un hijo o clase desde un escritorio o portátil convencional.
