Repository: godiard/help-activity
Catalog: translated_po/*/dimensions.po
Languages: es

source: Dimensions
es: Dimensiones

source: About
es: Acerca de

source: Dimensions (previously known as Visual Match) is a pattern-matching game written for Sugar; it is included as part of the Honey collection of Sugar add-ons. The object of the game is to find sets of three cards where each attribute—color, shape, number of elements, and shading—either match on all three cards or are different on all three cards.
es: Dimensiones (anteriormente conocido como Partido Visual) es un juego de coincidencia de patrones por escrito para el azúcar; se incluye como parte de la colección de la miel de azúcar complementos.

source: Prime Dimensions is the number variant of Dimensions, where instead of shape, three prime numbers, 5, 7, and 11, are used. Texture is replaced by representation, e.g. Arabic numerals, Roman numerals, Mayan numerals, etc.
es: Prime dimensiones es la variante número de dimensiones, donde en lugar de la forma, tres números primos, 5, 7, y 11, se utilizan. Textura se sustituye por la representación, e. g. Números arábigos, números romanos, números mayas, etc..

source: Word Dimensions is the word variant of Dimensions, where instead of shape, three word categories are used: animal, food, celestial body. Texture is replaced by font attribute: bold, italic, normal.
es: Word Dimensiones es la palabra variante de dimensiones, donde en lugar de la forma, tres categorías de palabras se utilizan: animal, comida, cuerpo celeste. Textura se sustituye por atributo de fuente: negrita, cursiva, lo normal.

source: Visual Match is deprecated.
es: Partido Visual está en desuso.

source: Using Dimensions
es: Usando Dimensiones

source: The Basics
es: Los fundamentos

source: Play by clicking on three cards to make a match.
es: Jugar haciendo clic en tres cartas para hacer un partido.

source: As you click, the cards will move to the match area on the left side of the screen. (You can also drag the cards to the match area.)
es: Al hacer clic, las tarjetas se trasladarán al área de competición en el lado izquierdo de la pantalla. (También puedes arrastrar las cartas al área de competición. )

source: Once three cards are in the match area, a validation test is run:
es: Una vez tres cartas están en el área de competición, una prueba de validación se ejecuta:

source: If the cards make a `valid match <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_valid_matches>`_, a smiley face will appear.
es: Si las cartas hacen un `partido válido <http: // wiki. sugarlabs. org / go / Actividades / Dimensiones # Examples_of_valid_matches>, aparecerá una cara sonriente `_.

source: If they are an `invalid match <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_invalid_matches>`_, a frowny face will appear, which details as to why the cards do not match. Clicking on the smiley face will result in the match being removed and new cards dealt from the deck. Clicking on the frowny face will remove the last card in the match area back to the right side of the screen.
es: Si son un `partido válido <http: // wiki. sugarlabs. org / go / Actividades / Dimensiones # Examples_of_invalid_matches>, aparecerá una cara frowny `_, que detalla por qué las tarjetas no coinciden. Al hacer clic en la cara sonriente se traducirá en el partido que se retira y nuevas cartas repartidas desde la cubierta. Al hacer clic en la cara frowny eliminará la última carta en el área de competición de nuevo a la parte derecha de la pantalla.

source: Once the game is over, the screen will fill with smiley faces.
es: Una vez que el juego ha terminado, la pantalla se llene de caras sonrientes.

source: `Video of basic game play <http://www.dailymotion.com/video/xbuw5j_visual-match>`_
es: `Video del juego básico jugar <http: // www. dailymotion. com / video / xbuw5j_visual-partido> `_

source: Note: When Dimensions first starts up, it shows a simple animation of game play. Click on the screen to interrupt the animation and begin play.
es: Nota: Cuando Dimensiones primero pone en marcha, se muestra una animación sencilla del juego. Haga clic en la pantalla para interrumpir la animación y empezar a jugar.

source: More Details
es: Más detalles

source: Cards have four different attributes: color, shape, fill texture, and number of elements.
es: Las tarjetas tienen cuatro atributos diferentes: color, forma, textura de relleno, y el número de elementos.

source: The number version works with prime factors instead of shapes and textures. The word version works with semantic groupings.
es: El número de versión trabaja con factores primos en lugar de formas y texturas. La versión de la palabra trabaja con agrupaciones semánticas.

source: Matches must be valid across all four attributes. Examples of `valid <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_valid_matches>`_ and `invalid <http://wiki.sugarlabs.org/go/Activities/Dimensions#Examples_of_valid_matches>`_ matches are shown below.
es: Partidos deben ser válidos en los cuatro atributos. Ejemplos de `válido <http: // wiki. sugarlabs. org / go / Actividades / Dimensiones # Examples_of_valid_matches> `_ y` no válido <http: // wiki. sugarlabs. org / go / Actividades / Dimensiones # Examples_of_valid_matches> `_ partidos se muestran a continuación.

source: A valid match is defined by cards where each attribute is either the same on each card or different on each card, e.g, all three red cards or one red, one green, and one blue card. An invalid match is when two cards share and attribute and the third card does not, e.g., one red and two green cards.
es: Una coincidencia válida se define por las tarjetas donde cada atributo es o bien el mismo en cada tarjeta o diferente en cada tarjeta, e. g, las tres tarjetas rojas o uno rojo, uno verde y uno azul de tarjetas. Un partido no válida es cuando dos tarjetas compartir y atributo y la tercera tarjeta no, e. g. , Uno rojo y dos tarjetas verdes.

source: At the end of the game, all of the matches are displayed in a simple animation.
es: Al final del juego, todos los partidos se muestran en una animación sencilla.

source: Also, the game state is saved to the Journal and restored upon resume.
es: Además, el estado del juego se guarda en el Diario y restaurado en hoja de vida.

source: A simple cooperative sharing model is supported.
es: Un modelo de intercambio cooperativo sencilla es compatible.

source: Everyone works cooperatively to find matches. Only the initiator of the shared session can start new games, change game type or level.
es: Todo el mundo trabaja de manera cooperativa para encontrar coincidencias. Sólo el iniciador de la sesión compartida puede iniciar nuevos juegos, cambiar el tipo de juego o de nivel.

source: Examples of valid matches
es: Ejemplos de partidos válidos

source: Rows from top to bottom
es: Filas de arriba a abajo

source: The colors, shapes, and shade match; numbers are different.
es: Los colores, las formas, y el partido de sombra; números son diferentes.

source: The numbers match; colors, shapes and shade are different.
es: El partido números; colores, formas y sombra son diferentes.

source: Everything is different.
es: Todo es diferente.

source: Examples of invalid matches
es: Ejemplos de partidos no válidos

source: two of the same colors (red)
es: dos de los mismos colores (rojo)

source: two of the same shape (X)
es: dos de la misma forma (X)

source: two of the same shade (solid)
es: dos del mismo color (sólido)

source: two of the same number (2)
es: dos de el mismo número (2)

source: Additional Features
es: Características adicionales

source: Dimensions includes a computer (robot) assistant: The robot will help you find matches.
es: Dimensiones incluye un (robot) asistente ordenador: El robot le ayudará a encontrar coincidencias.

source: It operates on a timer—finding matches after an adjustable number of seconds. The robot is enabled/disabled by clicking on the button the the Tool menu. You can also use the robot as a computer opponent. Decreasing the time between moves increases the challenge.
es: El robot se activa / desactiva haciendo clic en el botón del menú de herramientas. También puede utilizar el robot como un opositor de la computadora. La disminución del tiempo entre los movimientos aumenta el desafío.

source: Dimensions includes Beginner, Intermediate, and Expert Modes.
es: Dimensiones incluye Principiante, Intermedio, y modos de expertos.

source: In Beginner Mode, there are only 9 (32) cards and only two card characteristics, In Intermediate mode, there are 27 (33) cards and three card characteristics. In Expert Mode, there are 81 (34) cards and four card characteristics.
es: En el modo Principiante, sólo hay 9 (32) tarjetas y sólo dos características de la tarjeta: En la pantalla intermedia, hay 27 (33) tarjetas y tres características de la tarjeta. En el modo experto, hay 81 (34) tarjetas y cuatro características de la tarjeta.

source: Dimensions includes number-search and word-search games in addition to the pattern-search game.
es: Dimensiones incluye número de búsqueda y palabra de búsqueda de juegos, además del juego de patrones de búsqueda.

source: There is an edit mode so that customized word lists can be used in the Word Game (and shared over the network). Also, you can load custom cards from the Journal.
es: Hay un modo de edición para que las listas de palabras personalizadas se pueden usar en el Juego Word (y compartidos a través de la red). Además, puede cargar tarjetas personalizadas del Diario.

source: The grid layout is arbitrary; there is no need to pick in rows or columns, or one from each column.
es: El diseño de cuadrícula es arbitraria; no hay necesidad de recoger en filas o columnas, o uno de cada columna.

source: The blank cards on the left are a place to display the most recent match; they can be otherwise ignored.
es: Las tarjetas en blanco a la izquierda son un lugar para mostrar la más reciente partido; que de lo contrario pueden ser ignorados.

source: A count of number of matches found is shown in the toolbar; when the robot assistant is helping, the count is displayed as two numbers, where the number of matches found by the robot is in parentheses, e.g., 3(2) would indicate that the robot found 2 matches out of a total of 5 (3+2) found so far.
es: Un conteo de número de coincidencias encontradas se muestra en la barra de herramientas; cuando el asistente robot está ayudando, la cuenta se muestra como dos números, donde el número de partidos encontrado por el robot aparece entre paréntesis, e. g. , 3 (2) indicaría que el robot encontraron 2 resultados de un total de 5 (3 + 2) se han encontrado hasta el momento.

source: Dimensions keeps track of your best times (one for Beginner Mode and one for Expert Mode). These times are displayed next to the level-mode buttons on the `Tools Toolbar <http://wiki.sugarlabs.org/go/Activities/Dimensions#The_toolbars>`_.
es: Dimensiones mantiene un registro de sus mejores momentos (uno para el modo principiante y uno para el modo experto). Estos tiempos se muestran junto a los botones de modo de nivel sobre las `Herramientas Toolbar <http: // wiki. sugarlabs. org / go / Actividades / Dimensiones # The_toolbars> `_.

source: As you improve, Dimensions will automatically advance you to a more difficult level of play.
es: A medida que mejore, Dimensiones automáticamente le avanzar a un nivel más difícil del juego.

source: You can select cards using the keyboard:
es: Puede seleccionar las tarjetas con el teclado:

source: Top Row
es: Fila superior

source: Second Row
es: Segunda Fila

source: Third Row
es: Tercera fila

source: Fourth Row
es: Cuarta Fila

source: Extra (bottom) Row
es: Extra (parte inferior) Fila

source: Watch out, because Dimensions can be very addictive.
es: Cuidado, porque dimensiones pueden ser muy adictivo.

source: Other modes of play
es: Otros modos de juego

source: Number Game
es: Número de Juego

source: Everything is different: colors, prime factors, and representations.
es: Todo es diferente: los colores, factores primos y representaciones.

source: Word Game
es: Juego de palabras

source: The words are from different semantic groups; the colors are different; the font style (bold) matches.
es: Las palabras son de diferentes grupos semánticos; los colores son diferentes; el estilo de fuente (negrita) coincide.

source: When there is no match
es: Cuando no hay ninguna coincidencia

source: On occasion, there is no match among the 12 cards on the grid. If there is no match, three additional cards are dealt along the bottom row as illustrated in the figure above.
es: En ocasiones, no hay ninguna coincidencia entre las 12 cartas en la parrilla. Si no hay ninguna coincidencia, tres tarjetas adicionales se reparten a lo largo de la fila inferior, como se ilustra en la figura anterior.

source: Gallery
es: Galería

source: From left to right,
es: De izquierda a derecha,

source: Basic play: two dimensions: number and color
es: Reproducción básica: dos dimensiones: número y color

source: Intermediate play: three dimensions: number, color, and shape
es: Intermedio: tres dimensiones: número, color y forma

source: Advanced play: four dimensions: number, color, shape, and texture
es: Juego avanzada: cuatro dimensiones: número, color, forma y textura

source: Numbers don't match
es: Los números no coinciden

source: Colors don't match
es: Los colores no coinciden

source: Shapes don't match
es: Formas no coinciden

source: Textures don't match
es: Texturas no coinciden

source: Prime factors (1,2,3,5,7 and 11) are used to determine matches
es: Factores primos (1,2,3,5,7 y 11) se utilizan para determinar coincidencias

source: Roman numerals and dots in a circle
es: Números romanos y puntos en un círculo

source: Hashes and products
es: Los valores hash y productos

source: Mayan
es: Maya

source: semantic word groups (animal, food, celestial objects) are used to determine matches
es: grupos semánticos de palabras (animal, comida, objetos celestes) se utilizan para determinar coincidencias

source: Editing the word list
es: Edición de la lista de palabras

source: Loading custom cards from the Journal
es: Cargando las tarjetas de encargo de la Revista

source: Custom cards loaded from the Journal
es: Aduana tarjetas cargadas desde el Diario

source: Playing with cards loaded from the Journal
es: Jugar con las tarjetas cargadas del Diario

source: the source code
es: el código fuente

source: Scores can be copied to the clipboard and then plotted by SimpleGraph.
es: Las puntuaciones pueden ser copiados al portapapeles y luego trazan por SimpleGraph.

source: Learning with Dimensions
es: Aprender con Dimensiones

source: At a basic level, Dimensions can be used to enhance the observational skills of young learners; they are repeatedly asked: what is the same? what is different? At a deeper level, the concepts of multidimensional sets can be explored.
es: En un nivel básico, dimensiones pueden ser utilizados para mejorar las habilidades de observación de los jóvenes estudiantes; se les pregunta repetidamente: ¿cuál es la misma? qué es diferente? A un nivel más profundo, los conceptos de conjuntos multidimensionales pueden ser explorados.

source: The numbers games can be used to explore different arithmetic representations.
es: Los juegos de números se pueden usar para explorar diferentes representaciones aritméticas.

source: Extending Dimensions
es: Extendiendo Dimensiones

source: Exploring the math
es: Exploración de la matemática

source: The combinatoric math behind Dimensions may be of interest to some learners: See `this <http://en.wikipedia.org/wiki/Set_%28game%29#Basic_Combinatorics_of_Set>`_ for an explanation.
es: La matemática combinatoria detrás dimensiones pueden ser de interés para algunos alumnos: Véase `este <http: // en. wikipedia. org / wiki / Set_% 28game% 29 # Basic_Combinatorics_of_Set> `_ para una explicación.

source: Creating a custom game
es: Creación de un juego personalizado

source: You can create your own set of cards for Dimensions. Use your favorite program for creating images (Paint, Turtle Art, Record, etc.) to make sets of cards. You need to create at least 9 cards in order to play at the beginner level (3 cards each along 2 dimensions). You can also make a collection of 27 cards (3 cards each along 3 dimensions) or 81 cards (3 cards each along 4 dimensions). The cards must all have the same name in the journal with the exception of a number, beginning with 1 and incrementing by 1, e.g., card.1.png, card.2.png, ... card.9.png. Any image format supported by Sugar should work and you do not have to include the image-type suffix in the title, e.g., card.1, card.2, ... card.9 will also work. Just be sure that the order corresponds to the serialization of your multidimensional space, e.g.:
es: Usted puede crear su propio sistema de tarjetas para Dimensiones. Usa tu programa favorito para crear imágenes (Pintura, Arte de la tortuga, registro, etc. ) Para hacer grupos de tarjetas. Es necesario crear al menos 9 cartas para poder jugar en el nivel principiante (3 cartas cada uno a lo largo de 2 dimensiones). También puede hacer una colección de 27 tarjetas (3 cartas cada uno a lo largo de 3 dimensiones) o 81 tarjetas (3 cartas cada uno a lo largo de 4 dimensiones). Las tarjetas deben tener el mismo nombre en la revista con la excepción de un número, empezando por 1 y por incremento a 1, e. g. , Tarjeta. 1. png, tarjeta. 2. png. . . tarjeta. 9. png. Cualquier formato de imagen con el apoyo de azúcar debe trabajar y usted no tiene que incluir el sufijo-tipo de imagen en el título, e. g. , Tarjeta. 1, tarjeta. 2,. . . tarjeta. 9 también funcionará. Sólo asegúrese de que la orden se corresponde con la serialización de su espacio multidimensional, e. g. :

source: card name
es: nombre de la tarjeta

source: dimension 1
es: dimensión 1

source: dimension 2
es: dimensión 2

source: my-card.1
es: mi tarjeta. 1

source: one
es: uno

source: red
es: rojo

source: my-card.2
es: mi tarjeta. 2

source: two
es: dos

source: my-card.3
es: mi tarjeta. 3

source: three
es: tres

source: my-card.4
es: mi tarjeta. 4

source: green
es: verde

source: my-card.5
es: mi tarjeta. 5

source: my-card.6
es: mi tarjeta. 6

source: my-card.7
es: mi tarjeta. 7

source: blue
es: azul

source: my-card.8
es: mi tarjeta. 8

source: my-card.9
es: mi tarjeta. 9

source: You load a set of custom cards from the Journal by clicking on the 'import image' icon |imp_img| and selecting any one image of your set. The rest will be loaded automatically.
es: Usted carga un conjunto de tarjetas de encargo de la Revista haciendo clic en la 'importación de imágenes' icono | imp_img | y seleccionar cualquier imagen de su conjunto. El resto se cargará automáticamente.

source: The above cards were generated in `Turtle Art <http://wiki.sugarlabs.org/go/Activities/Turtle_Art>`_. The sample code is supplied with `Turtle Art <http://wiki.sugarlabs.org/go/Activities/Turtle_Art>`_: set.ta, the code generates a deck of cards and saves them as SVG to the Journal.
es: Las tarjetas anteriores se generaron en `Turtle Art <http: // wiki. sugarlabs. org / go / Actividades / Turtle_Art> `_. El código de ejemplo se suministra con `Turtle Art <http: // wiki. sugarlabs. org / go / Actividades / Turtle_Art> `_: conjunto. ta, el código genera una baraja de cartas y las guarda como SVG al Diario.

source: Modifying Dimensions
es: Modificación Dimensiones

source: Show me the code
es: Muéstrame el código

source: You can explore the Dimensions source code [`cloning the project <http://git.sugarlabs.org/projects/visualmatch/repos/mainline>`_] directly from git.
es: Usted puede explorar el código fuente Dimensiones [`clonación del proyecto <http: // git. sugarlabs. org / proyectos / visualmatch / repos / línea principal> `_] directamente desde git.

source: Reporting Problems
es: Informar de fallos

source: There are several known problems with the current version of Dimensions:
es: Hay varios problemas conocidos con la versión actual de Dimensiones:

source: Restore from Journal does not work on pre-0.82 versions of Sugar.
es: Restaurar desde el Diario no funciona en versiones de Sugar previas a 0.82

source: Chinese Cards don't display properly on some systems due to a missing font.
es: Tarjetas chinas no se muestran correctamente en algunos sistemas debido a una fuente que falta.

source: There is no indication of whom found the match in group play.
es: No hay ninguna indicación de los cuales se encontró el partido en juego en grupo.

source: If you discover a bug in the program or have a suggestion for an enhancement, please `file a ticket <https://bugs.sugarlabs.org/newticket?component=Visual+Match>`_ in our bug-tracking system.
es: Si usted descubre un error en el programa o tiene una sugerencia para una mejora, por favor `presentar un boleto <https: // bichos. sugarlabs. componente = + Partido> `_ en nuestro sistema de seguimiento de errores de Visual org / newticket?.

source: You can `view the open tickets here. <https://bugs.sugarlabs.org/query?status=accepted&status=assigned&status=new&status=reopened&component=Visual+Match>`_
es: Puede `ver los tickets abiertos aquí. <https://bugs.sugarlabs.org/query?status=accepted&status=assigned&status=new&status=reopened&component=Visual+Match>`_

source: Credits
es: Créditos

source: Dimensions was written by `Walter Bender <http://wiki.sugarlabs.org/go/User:Walter>`_ and the students from his 2009-2010 freshman seminar at MIT: Games, Puzzles, and Other Things to Think With. Special thanks to Michele Pratusevich and Vincent Le, as well as Mark Battley.
es: Dimensiones fue escrito por `Walter Bender <http: // wiki. sugarlabs. org / go / Usuario: Walter> `_ y los estudiantes de su seminario de primer año 2009-2010 en el MIT: juegos, rompecabezas y otras cosas para pensar con la. Un agradecimiento especial a Michele Pratusevich y Vincent Le, así como Mark Battley.

source: References
es: Referencias

source: `Wiki page <http://wiki.sugarlabs.org/go/Activities/Dimensions>`_
es: `Página Wiki <http: // wiki. sugarlabs. org / go / Actividades / Dimensiones> `_
